Кафе/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <basedOn>Document.ТабельУчетаРабочегоВремени</basedOn>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыплаты</name>
    <type>
      <types>EnumRef.ВидВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПочасоваяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвансВыработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗарплатаВыработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>УдержаноИзЗп</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПФР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Кафе/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени") Тогда
		Для Каждого ТекСтрокаТабель Из ДанныеЗаполнения.Табель Цикл
			НоваяСтрока = Зарплата.Добавить();
			НоваяСтрока.Должность = ТекСтрокаТабель.Должность;
			НоваяСтрока.ПочасоваяСтавка = ТекСтрокаТабель.Ставка;
			НоваяСтрока.Сотрудник = ТекСтрокаТабель.ФИО;
			НоваяСтрока.АвансВыработка = ТекСтрокаТабель.ИтогоПолмесяца;
			НоваяСтрока.ЗарплатаВыработка = ТекСтрокаТабель.ИтогоВтораяПоловина;
			НоваяСтрока = Удержания.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаТабель.ФИО;
			КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
	КонецЕсли;
КонецПроцедуры
